#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cloudacode/vpc-provisioing-ipam/runs/run-fnbVJ3N27DwUEWeT

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01cf9eecedd313f41]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-097ec60e3b7ad5680]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ad55648028bbf765]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09452dc70e5c9ab06]
data.aws_vpc_ipam_pool.this: Reading...
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0392a3fcadca41451]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09452dc70e5c9ab061080289494]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09969a9e1231bd59b]
data.aws_vpc_ipam_pool.this: Read complete after 1s [id=ipam-pool-08ecf378574aa542e]
data.aws_vpc_ipam_preview_next_cidr.this: Reading...
data.aws_vpc_ipam_preview_next_cidr.this: Read complete after 0s [id=10.3.0.0/16_ipam-pool-08ecf378574aa542e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.this[0] will be destroyed
  # (because aws_internet_gateway.this is not in configuration)
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-east-1:255171805824:internet-gateway/igw-01cf9eecedd313f41" -> null
      - id       = "igw-01cf9eecedd313f41" -> null
      - owner_id = "255171805824" -> null
      - tags     = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod"
          - "Org"  = "cloudacode.com"
        } -> null
      - tags_all = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod"
          - "Org"  = "cloudacode.com"
        } -> null
      - vpc_id   = "vpc-0ad55648028bbf765" -> null
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be destroyed
  # (because aws_route.public_internet_gateway is not in configuration)
  - resource "aws_route" "public_internet_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-01cf9eecedd313f41" -> null
      - id                     = "r-rtb-09452dc70e5c9ab061080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-09452dc70e5c9ab06" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route_table.private[0] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:255171805824:route-table/rtb-09969a9e1231bd59b" -> null
      - id               = "rtb-09969a9e1231bd59b" -> null
      - owner_id         = "255171805824" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod-private-us-east-1a"
          - "Org"  = "cloudacode.com"
        } -> null
      - tags_all         = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod-private-us-east-1a"
          - "Org"  = "cloudacode.com"
        } -> null
      - vpc_id           = "vpc-0ad55648028bbf765" -> null
    }

  # module.vpc.aws_route_table.private[1] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:255171805824:route-table/rtb-0392a3fcadca41451" -> null
      - id               = "rtb-0392a3fcadca41451" -> null
      - owner_id         = "255171805824" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod-private-us-east-1b"
          - "Org"  = "cloudacode.com"
        } -> null
      - tags_all         = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod-private-us-east-1b"
          - "Org"  = "cloudacode.com"
        } -> null
      - vpc_id           = "vpc-0ad55648028bbf765" -> null
    }

  # module.vpc.aws_route_table.private[2] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:255171805824:route-table/rtb-097ec60e3b7ad5680" -> null
      - id               = "rtb-097ec60e3b7ad5680" -> null
      - owner_id         = "255171805824" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod-private-us-east-1c"
          - "Org"  = "cloudacode.com"
        } -> null
      - tags_all         = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod-private-us-east-1c"
          - "Org"  = "cloudacode.com"
        } -> null
      - vpc_id           = "vpc-0ad55648028bbf765" -> null
    }

  # module.vpc.aws_route_table.public[0] will be destroyed
  # (because aws_route_table.public is not in configuration)
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-1:255171805824:route-table/rtb-09452dc70e5c9ab06" -> null
      - id               = "rtb-09452dc70e5c9ab06" -> null
      - owner_id         = "255171805824" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-01cf9eecedd313f41"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod-public"
          - "Org"  = "cloudacode.com"
        } -> null
      - tags_all         = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod-public"
          - "Org"  = "cloudacode.com"
        } -> null
      - vpc_id           = "vpc-0ad55648028bbf765" -> null
    }

  # module.vpc.aws_vpc.this[0] will be destroyed
  # (because aws_vpc.this is not in configuration)
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:us-east-1:255171805824:vpc/vpc-0ad55648028bbf765" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.2.0.0/16" -> null
      - default_network_acl_id               = "acl-0b6b05fe9ccfaf697" -> null
      - default_route_table_id               = "rtb-0875eca3251e37e33" -> null
      - default_security_group_id            = "sg-0f074c38acdbf00ff" -> null
      - dhcp_options_id                      = "dopt-aa717bc8" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-0ad55648028bbf765" -> null
      - instance_tenancy                     = "default" -> null
      - ipv4_ipam_pool_id                    = "ipam-pool-08ecf378574aa542e" -> null
      - ipv4_netmask_length                  = 16 -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0875eca3251e37e33" -> null
      - owner_id                             = "255171805824" -> null
      - tags                                 = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod"
          - "Org"  = "cloudacode.com"
        } -> null
      - tags_all                             = {
          - "Env"  = "prod"
          - "Name" = "cloudacode-prod"
          - "Org"  = "cloudacode.com"
        } -> null
    }

  # module.vpc-prod.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod"
          + "Org"  = "cloudacode.com"
        }
      + tags_all = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc-prod.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc-prod.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + tags_all         = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + tags_all         = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + tags_all         = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public"
          + "Org"  = "cloudacode.com"
        }
      + tags_all         = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = (known after apply)
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv4_ipam_pool_id                    = "ipam-pool-08ecf378574aa542e"
      + ipv4_netmask_length                  = 16
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                             = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod"
          + "Org"  = "cloudacode.com"
        }
    }

Plan: 19 to add, 0 to change, 7 to destroy.

Changes to Outputs:
  ~ vpc_cidr_block = "10.2.0.0/16" -> (known after apply)
  ~ vpc_id         = "vpc-0ad55648028bbf765" -> (known after apply)

```

</details>

*Pushed by: @kcfigaro, Action: `pull_request`*